{
  "extName": {
    "message": "Blueprint MCP for Opera",
    "description": "The name of the extension"
  },
  "extDescription": {
    "message": "Browser automation for Claude without token limits. Uses CSS selectors, not snapshots. Open source, zero telemetry.",
    "description": "The description of the extension"
  },
  "storeDesc": {
    "message": "Give Claude Code (and other AI assistants) direct control of your real Opera browser\n\nStop wrestling with headless browsers, bot detection, and authentication flows. Blueprint MCP for Opera bridges the Model Context Protocol (MCP) with your actual Opera browser - keeping you logged into all your sites, preserving your extensions, and using your real browser fingerprint.\n\nTHE CRITICAL ADVANTAGE: Efficient browser automation that does not consume your AI's context. Instead of sending massive page snapshots with every action (which quickly exhausts context limits and often exceeds MCP response size limits), Blueprint MCP lets your AI interact directly - click, type, navigate - and only fetch page content when specifically needed.\n\nKEY FEATURES\n\nReal Browser Automation:\n- Uses your actual Opera profile - Stays logged into Gmail, GitHub, AWS, etc.\n- Stealth mode - No bot detection. Uses your real browser fingerprint\n- Extension support - Works alongside your existing Opera extensions\n- Session persistence - No re-authentication needed\n\nNative MCP Integration:\n- 20+ browser tools exposed via Model Context Protocol\n- Tab management - Create, switch, close tabs programmatically\n- DOM inspection - Get accessible page content\n- Network monitoring - Capture requests, replay with authentication\n- JavaScript execution - Run code in page context\n\nTwo Connection Modes:\n- Free (Local) - WebSocket on localhost:5555, no cloud dependencies\n- PRO (Cloud Relay) - Control browser from anywhere, multiple AI clients\n\nSECURITY & PRIVACY\n\n- All communication stays on your machine (localhost WebSocket)\n- Zero data sent to cloud\n- No tracking, telemetry, or analytics\n- Works completely offline\n- Open source: https://github.com/railsblueprint/blueprint-mcp\n\nBlueprint MCP for Opera - Give your AI assistant the browser automation it deserves.\n\nhttps://blueprint-mcp.railsblueprint.com",
    "description": "Full description for Opera Add-ons Store"
  }
}
